Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СписаниеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураСПР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);   
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СТЧ = Элементы.Товары.ТекущиеДанные; 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);  
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.Товары Цикл    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ); 
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	Объект.ИтоговаяСумма = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписатьПоЗакупочнойЦене(Команда)  
	СТЧ = Элементы.Товары.ТекущиеДанные;
	СТЧ.Цена = ИнвентаризацияОМ.ПодстановкаЗакупочнойЦены(Объект.Дата, СТЧ.Номенклатура); 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура СписатьПоРозничнойЦене(Команда)
	СТЧ = Элементы.Товары.ТекущиеДанные;
	СТЧ.Цена = ИнвентаризацияОМ.ПодстановкаНовойЦены(Объект.Дата, СТЧ.Номенклатура);
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры
